Reports/ОтчётыПоЗаказам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ОтчётыПоЗаказам</Name>
		</Properties>
	</Report>
</MetaDataObject>

Documents/Заказ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Заказ</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПредоплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаСНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтогЦенаСНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Спецификация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Аксессуары</v8:Type>
								<v8:Type>cfg:CatalogRef.Продукция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/ОтчётыПоЗаказам/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура Сформировать(Команда)
    СформироватьВНовомОкне();
КонецПроцедуры

&НаСервере
Функция ПолучитьОтчёт()
    Запрос = Новый Запрос;
    
    ЗапросПроверка = Новый Запрос;
    ЗапросПроверка.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 Заказ.Ссылка ИЗ Документ.Заказ КАК Заказ ГДЕ Заказ.Проведен = ИСТИНА";
    Если ЗапросПроверка.Выполнить().Пустой() Тогда
        Таб = Новый ТабличныйДокумент;
        Таб.Область(1, 1).Текст = "Нет проведённых заказов.";
        Возврат Таб;
    КонецЕсли;
    
    // Частые клиенты
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   Заказ.Клиент КАК Клиент,
    |   КОЛИЧЕСТВО(Заказ.Ссылка) КАК КоличествоЗаказов
    |ИЗ
    |   Документ.Заказ КАК Заказ
    |ГДЕ
    |   Заказ.Проведен = ИСТИНА
    |СГРУППИРОВАТЬ ПО
    |   Заказ.Клиент
    |УПОРЯДОЧИТЬ ПО
    |   КОЛИЧЕСТВО(Заказ.Ссылка) УБЫВ";
    
    РезЗапроса = Запрос.Выполнить();
    Выборка = РезЗапроса.Выбрать();
    
    Таб = Новый ТабличныйДокумент;
    Таб.Область(1, 1).Текст = "Клиент";
    Таб.Область(1, 2).Текст = "Количество заказов";
    
    Стр = 2;
    Пока Выборка.Следующий() Цикл
        Таб.Область(Стр, 1).Текст = Выборка.Клиент;
        Таб.Область(Стр, 2).Текст = Выборка.КоличествоЗаказов;
        Стр = Стр + 1;
    КонецЦикла;
    
    // Разделитель
    Стр = Стр + 1;
    Таб.Область(Стр, 1).Текст = "";
    
    Стр = Стр + 1;
    Таб.Область(Стр, 1).Текст = "Самые дорогие заказы:";
    
    Стр = Стр + 1;
    Таб.Область(Стр, 1).Текст = "Заказ";
    Таб.Область(Стр, 2).Текст = "Клиент";
    Таб.Область(Стр, 3).Текст = "Сумма";
    
    // Дорогие заказы
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   Заказ.Ссылка КАК Заказ,
    |   Заказ.Клиент КАК Клиент,
    |   Заказ.СуммаДокумента КАК Сумма
    |ИЗ
    |   Документ.Заказ КАК Заказ
    |ГДЕ
    |   Заказ.Проведен = ИСТИНА
    |УПОРЯДОЧИТЬ ПО
    |   Заказ.СуммаДокумента УБЫВ";
    
    РезЗапроса2 = Запрос.Выполнить();
    Выборка2 = РезЗапроса2.Выбрать();
    
    Стр = Стр + 1;
    Пока Выборка2.Следующий() Цикл
        Таб.Область(Стр, 1).Текст = Выборка2.Заказ;
        Таб.Область(Стр, 2).Текст = Выборка2.Клиент;
        Таб.Область(Стр, 3).Текст = Выборка2.Сумма;
        Стр = Стр + 1;
    КонецЦикла;
    
    Возврат Таб;
КонецФункции

&НаКлиенте
Процедура СформироватьВНовомОкне()
    Таб = ПолучитьОтчёт();
    Таб.Показать("Отчёты по заказам");
КонецПроцедуры
